Show / Hide Table of Contents
Class MatReinforcementHKG
Material reinforcement HKG
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatReinforcement
MatReinforcementHKG
Inherited Members
 MatReinforcement.BarSurface
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.American.MatReinforcementHKG,CI.Material", "CI.StructModel.Libraries.Material.IMatReinforcement,CI.BasicTypes", typeof(MatReinforcement))]
public class MatReinforcementHKG : MatReinforcement
Constructors
Improve this Doc   View Source
MatReinforcementHKG()
Constructor
Declaration
public MatReinforcementHKG()
Properties
Improve this Doc   View Source
Epssu
Characteristic strain of reinforcement
Declaration
public double Epssu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fy
Characteristic yield strength of reinforcement
Declaration
public double Fy { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source